7767517
348 424
Input                    in0                      0 1 in0
Convolution              conv_95                  1 1 in0 1 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=864
Swish                    silu_20                  1 1 1 2
Convolution              conv_96                  1 1 2 3 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=18432
Swish                    silu_21                  1 1 3 4
Convolution              conv_97                  1 1 4 5 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_22                  1 1 5 6
Slice                    split_0                  1 2 6 7 8 -23300=2,32,32 1=0
Split                    splitncnn_0              1 3 8 9 10 11
Convolution              conv_98                  1 1 11 12 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608
Swish                    silu_23                  1 1 12 13
Convolution              conv_99                  1 1 13 14 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608
Split                    splitncnn_1              1 2 14 15 16
Sigmoid                  sigmoid_5                1 1 16 17
BinaryOp                 mul_0                    2 1 15 17 18 0=2
BinaryOp                 add_1                    2 1 10 18 19 0=0
Concat                   cat_0                    3 1 7 9 19 20 0=0
Convolution              conv_100                 1 1 20 21 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=12288
Swish                    silu_24                  1 1 21 22
Convolution              conv_101                 1 1 22 23 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=147456
Swish                    silu_25                  1 1 23 24
Convolution              conv_102                 1 1 24 25 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_26                  1 1 25 26
Slice                    split_1                  1 2 26 27 28 -23300=2,64,64 1=0
Split                    splitncnn_2              1 3 28 29 30 31
Convolution              conv_103                 1 1 31 32 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432
Swish                    silu_27                  1 1 32 33
Convolution              conv_104                 1 1 33 34 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432
Split                    splitncnn_3              1 2 34 35 36
Sigmoid                  sigmoid_6                1 1 36 37
BinaryOp                 mul_2                    2 1 35 37 38 0=2
BinaryOp                 add_3                    2 1 30 38 39 0=0
Concat                   cat_1                    3 1 27 29 39 40 0=0
Convolution              conv_105                 1 1 40 41 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=49152
Swish                    silu_28                  1 1 41 42
Split                    splitncnn_4              1 2 42 43 44
Convolution              conv_106                 1 1 44 45 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=589824
Swish                    silu_29                  1 1 45 46
Convolution              conv_107                 1 1 46 47 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_30                  1 1 47 48
Slice                    split_2                  1 2 48 49 50 -23300=2,128,128 1=0
Split                    splitncnn_5              1 3 50 51 52 53
Convolution              conv_108                 1 1 53 54 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Convolution              conv_109                 1 1 52 55 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_31                  1 1 54 56
Split                    splitncnn_6              1 2 56 57 58
Swish                    silu_32                  1 1 55 59
Convolution              conv_110                 1 1 58 60 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_33                  1 1 60 61
Convolution              conv_111                 1 1 61 62 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Split                    splitncnn_7              1 2 62 63 64
Sigmoid                  sigmoid_7                1 1 64 65
BinaryOp                 mul_4                    2 1 63 65 66 0=2
BinaryOp                 add_5                    2 1 57 66 67 0=0
Split                    splitncnn_8              1 2 67 68 69
Convolution              conv_112                 1 1 69 70 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_34                  1 1 70 71
Convolution              conv_113                 1 1 71 72 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Split                    splitncnn_9              1 2 72 73 74
Sigmoid                  sigmoid_8                1 1 74 75
BinaryOp                 mul_6                    2 1 73 75 76 0=2
BinaryOp                 add_7                    2 1 68 76 77 0=0
Concat                   cat_2                    2 1 77 59 78 0=0
Convolution              conv_114                 1 1 78 79 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_35                  1 1 79 80
Concat                   cat_3                    3 1 49 51 80 81 0=0
Convolution              conv_115                 1 1 81 82 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_36                  1 1 82 83
Split                    splitncnn_10             1 2 83 84 85
Convolution              conv_116                 1 1 85 86 0=512 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1179648
Swish                    silu_37                  1 1 86 87
Convolution              conv_117                 1 1 87 88 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Swish                    silu_38                  1 1 88 89
Slice                    split_3                  1 2 89 90 91 -23300=2,256,256 1=0
Split                    splitncnn_11             1 3 91 92 93 94
Convolution              conv_118                 1 1 94 95 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Convolution              conv_119                 1 1 93 96 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_39                  1 1 95 97
Split                    splitncnn_12             1 2 97 98 99
Swish                    silu_40                  1 1 96 100
Convolution              conv_120                 1 1 99 101 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_41                  1 1 101 102
Convolution              conv_121                 1 1 102 103 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_13             1 2 103 104 105
Sigmoid                  sigmoid_9                1 1 105 106
BinaryOp                 mul_8                    2 1 104 106 107 0=2
BinaryOp                 add_9                    2 1 98 107 108 0=0
Split                    splitncnn_14             1 2 108 109 110
Convolution              conv_122                 1 1 110 111 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_42                  1 1 111 112
Convolution              conv_123                 1 1 112 113 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_15             1 2 113 114 115
Sigmoid                  sigmoid_10               1 1 115 116
BinaryOp                 mul_10                   2 1 114 116 117 0=2
BinaryOp                 add_11                   2 1 109 117 118 0=0
Concat                   cat_4                    2 1 118 100 119 0=0
Convolution              conv_124                 1 1 119 120 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_43                  1 1 120 121
Concat                   cat_5                    3 1 90 92 121 122 0=0
Convolution              conv_125                 1 1 122 123 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=393216
Swish                    silu_44                  1 1 123 124
Split                    splitncnn_16             1 2 124 125 126
Convolution              conv_126                 1 1 126 127 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Split                    splitncnn_17             1 2 127 128 129
Pooling                  maxpool2d_2              1 1 129 130 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_18             1 2 130 131 132
Pooling                  maxpool2d_3              1 1 132 133 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_19             1 2 133 134 135
Pooling                  maxpool2d_4              1 1 135 136 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Concat                   cat_6                    4 1 128 131 134 136 137 0=0
Convolution              conv_127                 1 1 137 138 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
Split                    splitncnn_20             1 2 138 139 140
Sigmoid                  sigmoid_11               1 1 140 141
BinaryOp                 mul_12                   2 1 139 141 142 0=2
BinaryOp                 add_13                   2 1 142 125 143 0=0
Convolution              conv_128                 1 1 143 144 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Swish                    silu_45                  1 1 144 145
Slice                    split_4                  1 2 145 146 147 -23300=2,256,256 1=0
Split                    splitncnn_21             1 2 147 148 149
Convolution              conv_129                 1 1 149 150 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Reshape                  reshape_193              1 1 150 151 0=100 1=128 2=4
Slice                    split_5                  1 3 151 152 153 154 -23300=3,32,32,64 1=1
Split                    splitncnn_22             1 2 154 155 156
Permute                  permute_189              1 1 152 157 0=1
Reshape                  reshape_194              1 1 155 158 0=10 1=10 2=256
MatMul                   matmul_206               2 1 157 153 159
ConvolutionDepthWise     convdw_210               1 1 158 160 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
BinaryOp                 mul_14                   1 1 159 161 0=2 1=1 2=0.176777
Softmax                  softmax_93               1 1 161 162 0=2 1=1
MatMul                   matmultransb_0           2 1 156 162 163 0=1
Reshape                  reshape_195              1 1 163 164 0=10 1=10 2=256
BinaryOp                 add_15                   2 1 164 160 165 0=0
Convolution              conv_130                 1 1 165 166 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
BinaryOp                 add_16                   2 1 148 166 167 0=0
Split                    splitncnn_23             1 2 167 168 169
Convolution              conv_131                 1 1 169 170 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_46                  1 1 170 171
Convolution              conv_132                 1 1 171 172 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
BinaryOp                 add_17                   2 1 168 172 173 0=0
Concat                   cat_7                    2 1 146 173 174 0=0
Convolution              conv_133                 1 1 174 175 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Swish                    silu_47                  1 1 175 176
Split                    splitncnn_24             1 2 176 177 178
Interp                   interpolate_0            1 1 178 179 0=1 1=2.0 2=2.0 6=0
Concat                   cat_8                    2 1 179 84 180 0=0
Convolution              conv_134                 1 1 180 181 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=196608
Swish                    silu_48                  1 1 181 182
Slice                    split_6                  1 2 182 183 184 -23300=2,128,128 1=0
Split                    splitncnn_25             1 3 184 185 186 187
Convolution              conv_135                 1 1 187 188 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Convolution              conv_136                 1 1 186 189 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_49                  1 1 188 190
Split                    splitncnn_26             1 2 190 191 192
Swish                    silu_50                  1 1 189 193
Convolution              conv_137                 1 1 192 194 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_51                  1 1 194 195
Convolution              conv_138                 1 1 195 196 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Split                    splitncnn_27             1 2 196 197 198
Sigmoid                  sigmoid_12               1 1 198 199
BinaryOp                 mul_18                   2 1 197 199 200 0=2
BinaryOp                 add_19                   2 1 191 200 201 0=0
Split                    splitncnn_28             1 2 201 202 203
Convolution              conv_139                 1 1 203 204 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_52                  1 1 204 205
Convolution              conv_140                 1 1 205 206 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Split                    splitncnn_29             1 2 206 207 208
Sigmoid                  sigmoid_13               1 1 208 209
BinaryOp                 mul_20                   2 1 207 209 210 0=2
BinaryOp                 add_21                   2 1 202 210 211 0=0
Concat                   cat_9                    2 1 211 193 212 0=0
Convolution              conv_141                 1 1 212 213 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_53                  1 1 213 214
Concat                   cat_10                   3 1 183 185 214 215 0=0
Convolution              conv_142                 1 1 215 216 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_54                  1 1 216 217
Split                    splitncnn_30             1 2 217 218 219
Interp                   interpolate_1            1 1 219 220 0=1 1=2.0 2=2.0 6=0
Concat                   cat_11                   2 1 220 43 221 0=0
Convolution              conv_143                 1 1 221 222 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_55                  1 1 222 223
Slice                    split_7                  1 2 223 224 225 -23300=2,64,64 1=0
Split                    splitncnn_31             1 3 225 226 227 228
Convolution              conv_144                 1 1 228 229 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Convolution              conv_145                 1 1 227 230 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_56                  1 1 229 231
Split                    splitncnn_32             1 2 231 232 233
Swish                    silu_57                  1 1 230 234
Convolution              conv_146                 1 1 233 235 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_58                  1 1 235 236
Convolution              conv_147                 1 1 236 237 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Split                    splitncnn_33             1 2 237 238 239
Sigmoid                  sigmoid_14               1 1 239 240
BinaryOp                 mul_22                   2 1 238 240 241 0=2
BinaryOp                 add_23                   2 1 232 241 242 0=0
Split                    splitncnn_34             1 2 242 243 244
Convolution              conv_148                 1 1 244 245 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_59                  1 1 245 246
Convolution              conv_149                 1 1 246 247 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Split                    splitncnn_35             1 2 247 248 249
Sigmoid                  sigmoid_15               1 1 249 250
BinaryOp                 mul_24                   2 1 248 250 251 0=2
BinaryOp                 add_25                   2 1 243 251 252 0=0
Concat                   cat_12                   2 1 252 234 253 0=0
Convolution              conv_150                 1 1 253 254 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_60                  1 1 254 255
Concat                   cat_13                   3 1 224 226 255 256 0=0
Convolution              conv_151                 1 1 256 257 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_61                  1 1 257 258
Split                    splitncnn_36             1 3 258 259 260 261
Convolution              conv_152                 1 1 260 262 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=147456
Convolution              conv_153                 1 1 259 263 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
ConvolutionDepthWise     convdw_211               1 1 261 264 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
Swish                    silu_62                  1 1 262 265
Swish                    silu_63                  1 1 263 266
Swish                    silu_64                  1 1 264 267
Concat                   cat_14                   2 1 265 218 268 0=0
Convolution              conv_154                 1 1 266 269 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Convolution              conv_155                 1 1 267 270 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Convolution              conv_156                 1 1 268 271 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_65                  1 1 269 272
Swish                    silu_66                  1 1 270 273
Swish                    silu_67                  1 1 271 274
Convolution              conv_157                 1 1 272 275 0=4 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=128
ConvolutionDepthWise     convdw_212               1 1 273 276 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
Slice                    split_8                  1 2 274 277 278 -23300=2,128,128 1=0
Split                    splitncnn_37             1 3 278 279 280 281
Reshape                  reshape_196              1 1 275 282 0=1600 1=4
Convolution              conv_158                 1 1 281 283 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Convolution              conv_159                 1 1 280 284 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_68                  1 1 276 285
Convolution              conv_160                 1 1 285 286 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_69                  1 1 283 287
Split                    splitncnn_38             1 2 287 288 289
Swish                    silu_70                  1 1 284 290
Convolution              conv_161                 1 1 289 291 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_71                  1 1 286 292
Convolution              conv_162                 1 1 292 293 0=7 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=896
Swish                    silu_72                  1 1 291 294
Reshape                  reshape_197              1 1 293 295 0=1600 1=7
Convolution              conv_163                 1 1 294 296 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Split                    splitncnn_39             1 2 296 297 298
Sigmoid                  sigmoid_16               1 1 298 299
BinaryOp                 mul_26                   2 1 297 299 300 0=2
BinaryOp                 add_27                   2 1 288 300 301 0=0
Split                    splitncnn_40             1 2 301 302 303
Convolution              conv_164                 1 1 303 304 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_73                  1 1 304 305
Convolution              conv_165                 1 1 305 306 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Split                    splitncnn_41             1 2 306 307 308
Sigmoid                  sigmoid_17               1 1 308 309
BinaryOp                 mul_28                   2 1 307 309 310 0=2
BinaryOp                 add_29                   2 1 302 310 311 0=0
Concat                   cat_15                   2 1 311 290 312 0=0
Convolution              conv_166                 1 1 312 313 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_74                  1 1 313 314
Concat                   cat_16                   3 1 277 279 314 315 0=0
Convolution              conv_167                 1 1 315 316 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_75                  1 1 316 317
Split                    splitncnn_42             1 3 317 318 319 320
Convolution              conv_168                 1 1 319 321 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=589824
Convolution              conv_169                 1 1 318 322 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728
ConvolutionDepthWise     convdw_213               1 1 320 323 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
Swish                    silu_76                  1 1 321 324
Swish                    silu_77                  1 1 322 325
Swish                    silu_78                  1 1 323 326
Concat                   cat_17                   2 1 324 177 327 0=0
Convolution              conv_170                 1 1 325 328 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Convolution              conv_171                 1 1 326 329 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Convolution              conv_172                 1 1 327 330 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=393216
Swish                    silu_79                  1 1 328 331
Swish                    silu_80                  1 1 329 332
Swish                    silu_81                  1 1 330 333
Convolution              conv_173                 1 1 331 334 0=4 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=128
ConvolutionDepthWise     convdw_214               1 1 332 335 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
Slice                    split_9                  1 2 333 336 337 -23300=2,256,256 1=0
Split                    splitncnn_43             1 3 337 338 339 340
Reshape                  reshape_198              1 1 334 341 0=400 1=4
Convolution              conv_174                 1 1 340 342 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912
Swish                    silu_82                  1 1 335 343
Convolution              conv_175                 1 1 343 344 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_83                  1 1 342 345
Convolution              conv_176                 1 1 345 346 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912
Split                    splitncnn_44             1 2 346 347 348
Swish                    silu_84                  1 1 344 349
Sigmoid                  sigmoid_18               1 1 348 350
Convolution              conv_177                 1 1 349 351 0=7 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=896
Reshape                  reshape_199              1 1 351 352 0=400 1=7
BinaryOp                 mul_30                   2 1 347 350 353 0=2
BinaryOp                 add_31                   2 1 339 353 354 0=0
Split                    splitncnn_45             1 2 354 355 356
Convolution              conv_178                 1 1 356 357 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Reshape                  reshape_200              1 1 357 358 0=100 1=128 2=4
Slice                    split_10                 1 3 358 359 360 361 -23300=3,32,32,64 1=1
Split                    splitncnn_46             1 2 361 362 363
Permute                  permute_191              1 1 359 364 0=1
Reshape                  reshape_201              1 1 362 365 0=10 1=10 2=256
MatMul                   matmul_208               2 1 364 360 366
ConvolutionDepthWise     convdw_215               1 1 365 367 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
BinaryOp                 mul_32                   1 1 366 368 0=2 1=1 2=0.176777
Softmax                  softmax_94               1 1 368 369 0=2 1=1
MatMul                   matmultransb_1           2 1 363 369 370 0=1
Reshape                  reshape_202              1 1 370 371 0=10 1=10 2=256
BinaryOp                 add_33                   2 1 371 367 372 0=0
Convolution              conv_179                 1 1 372 373 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
BinaryOp                 add_34                   2 1 355 373 374 0=0
Split                    splitncnn_47             1 2 374 375 376
Convolution              conv_180                 1 1 376 377 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_85                  1 1 377 378
Convolution              conv_181                 1 1 378 379 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
BinaryOp                 add_35                   2 1 375 379 380 0=0
Concat                   cat_18                   3 1 336 338 380 381 0=0
Convolution              conv_182                 1 1 381 382 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=393216
Swish                    silu_86                  1 1 382 383
Split                    splitncnn_48             1 2 383 384 385
Convolution              conv_183                 1 1 384 386 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
ConvolutionDepthWise     convdw_216               1 1 385 387 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608 7=512
Swish                    silu_87                  1 1 386 388
Swish                    silu_88                  1 1 387 389
Convolution              conv_184                 1 1 388 390 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Convolution              conv_185                 1 1 389 391 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_89                  1 1 390 392
Swish                    silu_90                  1 1 391 393
Convolution              conv_186                 1 1 392 394 0=4 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=128
ConvolutionDepthWise     convdw_217               1 1 393 395 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
Reshape                  reshape_203              1 1 394 396 0=100 1=4
Concat                   cat_19                   3 1 282 341 396 397 0=1
Swish                    silu_91                  1 1 395 398
Convolution              conv_187                 1 1 398 399 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Slice                    tensor_split_0           1 2 397 400 401 -23300=2,2,-233 1=0
MemoryData               /model.23/Constant_12_output_0 0 1 402 0=2100 1=2
Split                    splitncnn_0              1 2 402 403 404
BinaryOp                 sub_36                   2 1 403 400 405 0=1
Split                    splitncnn_49             1 2 405 406 407
BinaryOp                 add_37                   2 1 404 401 408 0=0
Split                    splitncnn_50             1 2 408 409 410
Swish                    silu_92                  1 1 399 411
BinaryOp                 sub_38                   2 1 409 406 412 0=1
Convolution              conv_188                 1 1 411 413 0=7 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=896
BinaryOp                 add_39                   2 1 407 410 414 0=0
BinaryOp                 div_40                   1 1 414 415 0=3 1=1 2=2.0
Reshape                  reshape_204              1 1 413 416 0=100 1=7
Concat                   cat_20                   2 1 415 412 417 0=0
Concat                   cat_21                   3 1 295 352 416 418 0=1
MemoryData               /model.23/Constant_15_output_0 0 1 419 0=2100
Reshape                  reshape_205              1 1 419 420 0=2100 1=1
BinaryOp                 mul_41                   2 1 417 420 421 0=2
Sigmoid                  sigmoid_19               1 1 418 422
Concat                   cat_22                   2 1 421 422 out0 0=0
